date = input('XX.XX.XXXX: ')
d, m, y = date.split('.')
print(d,m,y)
months = {
'01': 'январь',
'02': 'февраль',
'03': 'март',
'04': 'апрель',
'05': 'май',
'06': 'июнь',
'07': 'июль',
'08': 'август',
'09': 'сентябрь',
'10': 'октябрь',
'11': 'ноябрь',
'12': 'декабрь'
}
days = {
'01': 'первое',
'02': 'второе',
'03': 'третье',
'04': 'четвертое',
'05': 'пятое',
'06': 'шестое',
'07': 'седьмое',
'08': 'восьмое',
'09': 'девятое',
'10': 'десятое',
'11': 'одиннадцетое',
'12': 'двенадцетое',
'13': 'тренадцетое',
'14': 'четырнадцетое',
'15': 'пятнадцетое',
'16': 'шеснадцетое',
'17': 'семнадцетое',
'18': 'восемнадсетое',
'19': 'девятнадцетое',
'20': 'двадцатое',
'21': 'двадцать первое',
'22': 'двадцать второе',
'23': 'двадцать третье ',
'24': 'двадцать четвертое',
'25': 'двадцать пятое',
'26': 'двадцать шестое',
'27': 'двадцать седьмое',
'28': 'двадцать восьмое ',
'29': 'двадцать девятое',
'30': 'тридцатое',
'31': 'тридцать первое'
}
result = f' {days[d]} {months[m]} {y} год.'
result = f'{days[d]} {months[m]} {y} год.'

print(result)